OdDAI.EnumerationType.#ctor(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,std.list&lt;OdAnsiString,std.allocator&lt;OdAnsiString&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new enumeration type object with specified parameters.
\param typeCode [in] A smart pointer to a type code of enumeration type.
\param elements [in] A list of values of enumeration type.